BasileBerckmoes/RobotComp2ELO/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/SCB_I2C_PDL_v1_0/API/SCB_I2C_PDL.h
/***************************************************************************//**
* \file `$INSTANCE_NAME`.c
* \version `$CY_MAJOR_VERSION`.`$CY_MINOR_VERSION`
*
*  This file provides constants and parameter values for the I2C component.
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(`$INSTANCE_NAME`_CY_SCB_I2C_PDL_H)
#define `$INSTANCE_NAME`_CY_SCB_I2C_PDL_H

#include "cyfitter.h"
#include "scb/cy_scb_i2c.h"

#if defined(__cplusplus)
extern "C" {
#endif

/***************************************
*   Initial Parameter Constants
****************************************/

#define `$INSTANCE_NAME`_MODE   (`$Mode`U)

#define `$INSTANCE_NAME`_ENABLE_SLAVE       (0UL != (`$INSTANCE_NAME`_MODE & CY_SCB_I2C_SLAVE))
#define `$INSTANCE_NAME`_ENABLE_MASTER      (0UL != (`$INSTANCE_NAME`_MODE & CY_SCB_I2C_MASTER))
#define `$INSTANCE_NAME`_MANUAL_SCL_CONTROL (0UL != `$EnableManualSclControl`UL)


/***************************************
*        Function Prototypes
***************************************/
/**
* \addtogroup group_general
* @{
*/
/* Component only APIs. */
void `$INSTANCE_NAME`_Start(void);

/* Basic functions. */
__STATIC_INLINE cy_en_scb_i2c_status_t `$INSTANCE_NAME`_Init(cy_stc_scb_i2c_config_t const *config);
__STATIC_INLINE void `$INSTANCE_NAME`_DeInit (void);
__STATIC_INLINE void `$INSTANCE_NAME`_Enable (void);
__STATIC_INLINE void `$INSTANCE_NAME`_Disable(void);

/* Data rate configuration functions. */
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_SetDataRate(uint32_t dataRateHz, uint32_t scbClockkHz);
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_GetDataRate(uint32_t scbClockkHz);

/* Register callbacks. */
__STATIC_INLINE void `$INSTANCE_NAME`_RegisterEventCallback(scb_i2c_handle_events_t callback);
#if (`$INSTANCE_NAME`_ENABLE_SLAVE)
__STATIC_INLINE void `$INSTANCE_NAME`_RegisterAddrCallback (scb_i2c_handle_addr_t callback);
#endif /* (`$INSTANCE_NAME`_ENABLE_SLAVE) */

/* Configuration functions. */
#if (`$INSTANCE_NAME`_ENABLE_SLAVE)
__STATIC_INLINE void     `$INSTANCE_NAME`_SlaveSetAddress(uint8_t addr);
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_SlaveGetAddress(void);
__STATIC_INLINE void     `$INSTANCE_NAME`_SlaveSetAddressMask(uint8_t addrMask);
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_SlaveGetAddressMask(void);
#endif /* (`$INSTANCE_NAME`_ENABLE_SLAVE) */

#if (`$INSTANCE_NAME`_ENABLE_MASTER)
__STATIC_INLINE void `$INSTANCE_NAME`_MasterSetLowPhaseDutyCycle (uint32_t clockCycles);
__STATIC_INLINE void `$INSTANCE_NAME`_MasterSetHighPhaseDutyCycle(uint32_t clockCycles);
#endif /* (`$INSTANCE_NAME`_ENABLE_MASTER) */

/* Bus status. */
__STATIC_INLINE bool     `$INSTANCE_NAME`_IsBusBusy(void);

/* Slave functions. */
#if (`$INSTANCE_NAME`_ENABLE_SLAVE)
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_SlaveGetStatus(void);

__STATIC_INLINE void     `$INSTANCE_NAME`_SlaveConfigReadBuf(uint8_t *rdBuf, uint32_t size);
__STATIC_INLINE void     `$INSTANCE_NAME`_SlaveAbortRead(void);
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_SlaveGetReadTransferCount(void);
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_SlaveClearReadStatus(void);

__STATIC_INLINE void     `$INSTANCE_NAME`_SlaveConfigWriteBuf(uint8_t *wrBuf, uint32_t size);
__STATIC_INLINE void     `$INSTANCE_NAME`_SlaveAbortWrite(void);
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_SlaveGetWriteTransferCount(void);
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_SlaveClearWriteStatus(void);
#endif /* (`$INSTANCE_NAME`_ENABLE_SLAVE) */

/* Master interrupt processing functions. */
#if (`$INSTANCE_NAME`_ENABLE_MASTER)
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_MasterGetStatus(void);

__STATIC_INLINE cy_en_scb_i2c_status_t `$INSTANCE_NAME`_MasterRead(cy_stc_scb_i2c_master_xfer_config_t *masterXferConfig);
__STATIC_INLINE void `$INSTANCE_NAME`_MasterAbortRead(void);
__STATIC_INLINE cy_en_scb_i2c_status_t `$INSTANCE_NAME`_MasterWrite(cy_stc_scb_i2c_master_xfer_config_t *masterXferConfig);
__STATIC_INLINE void `$INSTANCE_NAME`_MasterAbortWrite(void);
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_MasterGetTransferCount(void);

/* Master manual processing functions. */
__STATIC_INLINE cy_en_scb_i2c_status_t `$INSTANCE_NAME`_MasterSendStart(uint32_t address, uint32_t bitRnW, uint32_t timeoutMs);
__STATIC_INLINE cy_en_scb_i2c_status_t `$INSTANCE_NAME`_MasterSendReStart(uint32_t address, uint32_t bitRnW, uint32_t timeoutMs);
__STATIC_INLINE cy_en_scb_i2c_status_t `$INSTANCE_NAME`_MasterSendStop(uint32_t timeoutMs);
__STATIC_INLINE cy_en_scb_i2c_status_t `$INSTANCE_NAME`_MasterReadByte(uint32_t ackNack, uint8_t *byte, uint32_t timeoutMs);
__STATIC_INLINE cy_en_scb_i2c_status_t `$INSTANCE_NAME`_MasterWriteByte(uint32_t theByte, uint32_t timeoutMs);
#endif /* (`$INSTANCE_NAME`_ENABLE_MASTER) */

/* Interrupt handler. */
__STATIC_INLINE void `$INSTANCE_NAME`_Interrupt(void);
/** @} group_general */


/***************************************
*    Variables with External Linkage
***************************************/
/**
* \addtogroup group_globals
* @{
*/
extern uint8 `$INSTANCE_NAME`_initVar;
extern cy_stc_scb_i2c_config_t `=$CY_CONST_CONFIG ? "const " : ""``$INSTANCE_NAME`_config;
extern cy_stc_scb_i2c_context_t `$INSTANCE_NAME`_context;
/** @} group_globals */


/***************************************
*         Preprocessor Macros
***************************************/
/**
* \addtogroup group_macros
* @{
*/
/** The pointer to the base address of the SCB instance */
#define `$INSTANCE_NAME`_HW     ((CySCB_Type *) `$INSTANCE_NAME`_SCB__HW)

/** The desired data rate in Hz */
#define `$INSTANCE_NAME`_DATA_RATE_HZ      (`$DataRateHz`U)

/** The frequency of the clock used by the Component in Hz */
#define `$INSTANCE_NAME`_CLK_FREQ_HZ       (`$ScbClockHz`U)

