BasileBerckmoes/RobotComp2ELO/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/SCB_I2C_PDL_v1_0/API/SCB_I2C_PDL.h
/** The number of Component clocks used by the master to generate the SCL
* low phase. This number is calculated by GUI based on the selected data rate.
*/
#define `$INSTANCE_NAME`_LOW_PHASE_DUTY_CYCLE   (`$LowPhaseDutyCycle`U)

/** The number of Component clocks used by the master to generate the SCL
* high phase. This number is calculated by GUI based on the selected data rate.
*/
#define `$INSTANCE_NAME`_HIGH_PHASE_DUTY_CYCLE  (`$HighPhaseDutyCycle`U)
/** @} group_macros */


/***************************************
*    In-line Function Implementation
***************************************/

/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_Init
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_Init() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_i2c_status_t `$INSTANCE_NAME`_Init(cy_stc_scb_i2c_config_t const *config)
{
    return Cy_SCB_I2C_Init(`$INSTANCE_NAME`_HW, config, &`$INSTANCE_NAME`_context);
}


/*******************************************************************************
*  Function Name: `$INSTANCE_NAME`_DeInit
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_DeInit() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_DeInit(void)
{
    Cy_SCB_I2C_DeInit(`$INSTANCE_NAME`_HW);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_Enable
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_Enable() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_Enable(void)
{
    Cy_SCB_I2C_Enable(`$INSTANCE_NAME`_HW);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_Disable
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_Disable() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_Disable(void)
{
    Cy_SCB_I2C_Disable(`$INSTANCE_NAME`_HW, &`$INSTANCE_NAME`_context);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_SetDataRate
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SetDataRate() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_SetDataRate(uint32_t dataRateHz, uint32_t scbClockHz)
{
    return Cy_SCB_I2C_SetDataRate(`$INSTANCE_NAME`_HW, dataRateHz, scbClockHz);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_GetDataRate
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_GetDataRate() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_GetDataRate(uint32_t scbClockHz)
{
    return Cy_SCB_I2C_GetDataRate(`$INSTANCE_NAME`_HW, scbClockHz);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_RegisterEventCallback
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_RegisterEventCallback() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_RegisterEventCallback(scb_i2c_handle_events_t callback)
{
    Cy_SCB_I2C_RegisterEventCallback(`$INSTANCE_NAME`_HW, callback, &`$INSTANCE_NAME`_context);
}


#if (`$INSTANCE_NAME`_ENABLE_SLAVE)
/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_RegisterAddrCallback
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_RegisterAddrCallback() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_RegisterAddrCallback(scb_i2c_handle_addr_t callback)
{
    Cy_SCB_I2C_RegisterAddrCallback(`$INSTANCE_NAME`_HW, callback, &`$INSTANCE_NAME`_context);
}
#endif /* (`$INSTANCE_NAME`_ENABLE_SLAVE) */


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_IsBusBusy
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_IsBusBusy() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE bool `$INSTANCE_NAME`_IsBusBusy(void)
{
    return Cy_SCB_I2C_IsBusBusy(`$INSTANCE_NAME`_HW);
}


#if (`$INSTANCE_NAME`_ENABLE_SLAVE)
/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_SlaveSetAddress
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveGetAddress() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_SlaveSetAddress(uint8_t addr)
{
    Cy_SCB_I2C_SlaveSetAddress(`$INSTANCE_NAME`_HW, addr);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_SlaveGetAddress
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveGetAddress() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_SlaveGetAddress(void)
{
    return Cy_SCB_I2C_SlaveGetAddress(`$INSTANCE_NAME`_HW);
}


