BasileBerckmoes/RobotComp2ELO/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/SCB_I2C_PDL_v1_0/API/SCB_I2C_PDL.h
/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_MasterReadByte
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterReadByte() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_i2c_status_t `$INSTANCE_NAME`_MasterReadByte(uint32_t ackNack, uint8_t *byte, uint32_t timeoutMs)
{
    return Cy_SCB_I2C_MasterReadByte(`$INSTANCE_NAME`_HW, ackNack, byte, timeoutMs, &`$INSTANCE_NAME`_context);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_MasterWriteByte
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterWriteByte() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_i2c_status_t `$INSTANCE_NAME`_MasterWriteByte(uint32_t theByte, uint32_t timeoutMs)
{
    return Cy_SCB_I2C_MasterWriteByte(`$INSTANCE_NAME`_HW, theByte, timeoutMs, &`$INSTANCE_NAME`_context);
}
#endif /* (`$INSTANCE_NAME`_ENABLE_MASTER) */


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_Interrupt
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_Interrupt() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_Interrupt(void)
{
    Cy_SCB_I2C_Interrupt(`$INSTANCE_NAME`_HW, &`$INSTANCE_NAME`_context);
}

#if defined(__cplusplus)
}
#endif

#endif /* `$INSTANCE_NAME`_CY_SCB_I2C_PDL_H */


/* [] END OF FILE */
